pmo-dataset/mermaid/06.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ParallelGateway_1{"+"} --> Task_9["Generate shipping\nlabel"]
	ExclusiveGateway_1{"X"} --> Task_2["Customer places\norder online"]
	Task_2 --> ExclusiveGateway_2{"X"}
	StartNoneEvent_1(("start")) --> ExclusiveGateway_1
	Task_1["Successful delivery"] --> ExclusiveGateway_3{"X"}
	Task_10["Send tracking\ninformation to\ncustomer"] --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_2 --> Task_7["Generate and send\norder confirmation"]
	Task_4["Customer places\norder over the phone"] --> ExclusiveGateway_2
	Task_7 --> ParallelGateway_1
	Task_8["Process customer\nfeedback or returns"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_1 --> Task_6["Pick and pack items"]
	Task_5["Monitor shipment"] --> ExclusiveGateway_6{"X"}
	Task_9 --> ParallelGateway_2{"+"}
	Task_6 --> ParallelGateway_2
	ExclusiveGateway_1 --> Task_4
	ExclusiveGateway_3 --> Task_8
	ExclusiveGateway_6 --> Task_1
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ExclusiveGateway_5 --> EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_3 --> ExclusiveGateway_5
	ParallelGateway_2 --> Task_3["Hand over order to\nlogistics provider"]
	ExclusiveGateway_4 --> Task_5
	Task_3 --> Task_10
