pmo-dataset/variations/graphviz_basic/06.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ParallelGateway_1" -> "Generate shipping label";
  "ExclusiveGateway_1" -> "Customer places order online";
  "Customer places order online" -> "ExclusiveGateway_2";
  "start" -> "ExclusiveGateway_1";
  "Successful delivery" -> "ExclusiveGateway_3";
  "Send tracking information to customer" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "Generate and send order confirmation";
  "Customer places order over the phone" -> "ExclusiveGateway_2";
  "Generate and send order confirmation" -> "ParallelGateway_1";
  "Process customer feedback or returns" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Pick and pack items";
  "Monitor shipment" -> "ExclusiveGateway_6";
  "Generate shipping label" -> "ParallelGateway_2";
  "Pick and pack items" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "Customer places order over the phone";
  "ExclusiveGateway_3" -> "Process customer feedback or returns";
  "ExclusiveGateway_6" -> "Successful delivery";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "end";
  "ExclusiveGateway_3" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Hand over order to logistics provider";
  "ExclusiveGateway_4" -> "Monitor shipment";
  "Hand over order to logistics provider" -> "Send tracking information to customer";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
}
